relatedWork.tex
% Created 2018-02-09 fre 17:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\newcommand{\bibentry}[1]{\cite{#1}}
\author{Axel Demborg \texttt{demborg@kth.se}}
\date{\today}
\title{Related Work: Network Compression}
\hypersetup{
 pdfauthor={Axel Demborg \texttt{demborg@kth.se}},
 pdftitle={Related Work: Network Compression},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
