relatedWork.org
** Quantization of weights
# Modern neural networks are usually based on 32-bit floating point representations of parameters. It has been shown however that networks are quite resilient to noise and even that some noise can improve training[[bibentry:murray1994enhanced]]. Since reduced precision variables can be modeled as noise this means that networks can be compressed by changing to a less accurate format without any loss in performance. This can be done either by reducing the bit accuracy after training[[bibentry:vanhoucke2011improving]]  or by doing the entire training in reduced accuracy[[bibentry:hubara2016quantized]] [[bibentry:gupta2015deep]]. The benefits of using a reduced format like this for representation is not only that the models take less space but also that the individual multiplications become cheaper and hence the networks run faster.


** Weight sharing
# It was shown in[[bibentry:denil2013predicting]] that neural networks typically contain a lot of redundant parameters and that up to 95% of parameters could be predicted from the remaining 5% without any drop in accuracy. One of the most direct ways of reducing the number of parameters in the models ones where the weight matrices in the networks are dealt with directly, either by grouping weights during training with hashing functions [[bibentry:chen2015compressing]] or by clustering the weights after training[[bibentry:gong2014compressing]]. Both these approaches reported compression rates of about 20 times before any significant drop in accuracy was introduced which seems to confirm the results from[[bibentry:denil2013predicting]]. Further work in this area [[bibentry:han2015learning]] explores the effect of pruning away weights close to zero and thus achieves sparse weight matrices which are not only smaller to store but also faster to compute. Combined with some other tricks like /weight sharing/ and /Huffman coding/ this lets[[bibentry:han2015deep]] compress the storage required for AlexNet by a factor 35 and reduce the computation required by a factor 3 without any loss in accuracy on the ImageNet dataset.

One of the most direct approaches for removing the redundancy in parametrization from neural networks is by forcing the networks to share weights between different connections. This is precisely what /HashedNets/[[bibentry:chen2015compressing]] does by fixing the amount of weights \(K^l\) that are to be used in each layer \(\vec{w^l} \in \mathbb{R}^{K^l}\)  and using hashing functions to map each element in the virtual weight matrices \(V_{ij}^l\) to one of these weights \(V_{ij} = w_{h(i,j)} \) with \(h()\) being a hashing function. With the weight matrices defined in this fashion /HashedNets/ can be trained like normal networks with the gradients with respect to the weights calculated from the gradients with respect to the virtual matrices as 
\[ \frac{\partial\mathcal{L}}{\partial w_k^l} = \sum_{ij} \frac{\partial\mathcal{L}}{\partial V_{ij}^l}\frac{\partial V_{ij}^l}{\partial w_k^l} \]
This method gave a compression of about 20 times before any notable loss in accuracy was introduced during tests on variations of the MNIST dataset.

Other notable work focuses on the use of k-means clustering to cluster the weights in networks after training[[bibentry:gong2014compressing]], this proves to work very well and manages to compress the models with a factor 16 with no more than a 0.5% drop in classification accuracy on the ImageNet dataset.

