relatedWork.tex

\subsection*{Quantization of weights}
\label{sec:org8fe390b}


\subsection*{Weight sharing}
\label{sec:org90d895a}
One of the most direct approaches for removing the redundancy in parametrization from neural networks is by forcing the networks to share weights between different connections. This is precisely what \emph{HashedNets}\bibentry{chen2015compressing} does by fixing the amount of weights \(K^l\) that are to be used in each layer \(\vec{w^l} \in \mathbb{R}^{K^l}\)  and using hashing functions to map each element in the virtual weight matrices \(V_{ij}^l\) to one of these weights \(V_{ij} = w_{h(i,j)}\) with \(h()\) being a hashing function. With the weight matrices defined in this fashion \emph{HashedNets} can be trained like normal networks with the gradients with respect to the weights calculated from the gradients with respect to the virtual matrices as 
\[ \frac{\partial\mathcal{L}}{\partial w_k^l} = \sum_{ij} \frac{\partial\mathcal{L}}{\partial V_{ij}^l}\frac{\partial V_{ij}^l}{\partial w_k^l} \]
This method gave a compression of about 20 times before any notable loss in accuracy was introduced during tests on variations of the MNIST dataset.

Other notable work focuses on the use of k-means clustering to cluster the weights in networks after training\bibentry{gong2014compressing}, this proves to work very well and manages to compress the models with a factor 16 with no more than a 0.5\% drop in classification accuracy on the ImageNet dataset.
