relatedWork.tex

\subsection*{Student-teacher learning}
\label{sec:org142d5dc}
Student-teacher learning is a type of model compression where a smaller and/or faster to compute \emph{student} network is trained by making it learn the representations learned by a larger \emph{teacher} network. This idea was first introduced for compressing ensemble models produced by \emph{Ensemble Selection}\bibentry{caruana2004ensemble} which consist of hundreds of models of many different kinds, support vector machines, neural networks, memory based models, and decision trees into a single neural network\bibentry{bucilua2006model}. This work leverages the neural networks property of being universal approximators\bibentry{cybenko1989approximation}, meaning that given sufficiently much training data and a big enough hidden layer a neural network can learn to approximate any function with arbitrary precision, by not directly training the student network om the relatively limited labeled training data available but instead on large amounts of pseudo random data that has been given labels by first being passed through the large teacher ensemble. This compression technique yielded student networks up to 1000 times smaller and 1000 times faster to compute than  their teachers with a negligible drop in accuracy on some test problems.

Further work on student-teacher learning experiments with why deep neural networks usually perform better than shallow ones, even when they have the same amount of parameters, by training shallow student models to mimic deep teachers\bibentry{ba2014deep}. This work introduces two major modifications that make training of these student models feasible, firstly the student model isn't tasked with just recreating the same label as the teacher but also the same distribution which is achieved by regressing the student to the logits, log probability, values of the teacher as they were before softmax. Getting predictions from the student is then achieved by adding a softmax layer to the end of it after training. Secondly a bottleneck linear layer is added to the network to speed up training. With these modifications they are able to train flat neural networks for both the TMIT and CIFAR-10 datasets with performance closely matching that of single deep networks. Continued analysis of flat networks however shows that depth and convolutions are critical for getting good performance on image classification datasets\bibentry{urban2016deep}. Empirically this claim is supported by training state of the art, deep, convolutional models for classification on the CIFAR-10 dataset and then building an ensemble of such models using that as a teacher for shallow students. The student models were then compared to deep convolutional benchmarks that were not trained in a student-teacher fashion. To make sure that the networks were all performing to the best of their abilities and thus making the comparison fair Bayesian hyperparameter optimization\bibentry{snoek2012practical} was used. Through this thorough analysis it was found that shallow networks are unable to mimic the performance of deep networks if the number of parameters is held constant between them, these findings are also in agreement with the theoretical results that the representational efficiency of neural networks grows exponentially with layers\bibentry{liang2016deep}.

Improvements to the student-teacher learning method have been proposed where the student is tasked with minimizing the weighted average of the cross-entropy between its own output and the teacher output when the last layer is softmax with increased temperature, yielding softer labels, and the cross-entropy between the student output and the correct labels when they are available. This framework is called \emph{Distillation}\bibentry{hinton2015distilling} and proves to work very well for transferring of information from teacher to student which is demonstrated by training a student model with only 13.2\% test error on the MNIST dataset despite only having seen 7s and 8s during its own training. These results mean that distillation manages to transfer knowledge about how a 6 looks from the teacher to the student by only telling it to what degree different 7s and 8s don't look like 6s.

Continued work lead to the creation of \emph{FitNets}\bibentry{romero2014fitnets} which goes in the opposite direction to previous attempts at student architectures and instead proposes very deep but thin students. To enable learning in these deep student networks a stage-wise training procedure is used. In the first stage intermediate layers in the teacher and student networks are selected, these are called \emph{hint} and \emph{guided} layers respectively. The guided layer in the student is then tasked to mimic the hint layer in the teacher through a convolutional aggressor that compensates for the difference in number of outputs between the networks, this procedure gives a good initialization for the first layers in the student and allows for it to learn the internal representations of the data from the teacher. The second stage of training is then distillation as described above but with the small addition that the weight of the loss against the teacher is slowly annealed during training. This annealing allows for the student to lean heavily on the teacher for support in early stages of training and learn samples which the even the teacher struggles with towards the end of its training. Using this approach the \emph{FitNets} manage to produce predictions at the same level or in some cases even better than models with 10 times more parameters.

Some of the most resent work in student-teacher learning leverages \emph{attention} mechanisms for the transfer of knowledge allowing the student not only to learn what the teacher sees but also where in the image the teacher looks to see that\bibentry{zagouruyko2017paying}\footnote{måste läsa och faktiskt kunna skiten för att sammanfatta va}. 
