relatedWork.org
** Architectural optimizations
# /SqueezeNet/[[bibentry:iandola2016squeezenet]] presents a different take on how to get smaller models in that it rather optimizes the architecture of the network than any of the constituent parts, this approach gives a network with AlexNet performance but with 50 times fewer parameters than normal AlexNet. This is done by focusing on the usage of \(1 \times 1\) convolutional filters, reducing the amount of channels that go in to the larger filters and by holding out on downsampling so that feature maps are kept large through the network. It was also proven that these results were orthogonal from compression by running the SqueezeNet through the compression framework presented in[[bibentry:han2015deep]] and getting further 10 times compression with out accuracy loss.

# Another orthogonal approach for compression is to optimize the convolutional layers them selves making them require less parameters or less computation to perform their tasks but still keep as much as possible of their recreational power. One of the simplest things that can be done here is to replace single layers of \(N \times N\) convolutional filters with two layers with \(N \times 1\) and \(1 \times N\) filters respectively this reduces the amount of parameters that have to be stored per channel from \(N^2\) to \(2N\) and the amount of multiplications that have to be made scale in the same way. This approach has seen successful use in inception models[[bibentry:szegedy2016rethinking]]. 
# Other variations on the convolutional operator that help compress the networks are dilated convolutions[[bibentry:yu2015multi]] where an exponentially expanding receptive field is achieved without the need for any extra parameters. There have also been some promising results from /depthwise separable convolutions/ where the convolution is factored into a depthwise convolution followed by a pointwise \(1 \times 1\) convolution reducing the computational load with a factor \(8\) to \(9\) for \(3 \times 3\) convolutional kernels[[bibentry:howard2017mobilenets]]. This scheme was introduced in[[bibentry:sifre2014rigid]] and has since seen been successfully used in /MobileNets/[[bibentry:howard2017mobilenets]] and /Inception/ models[[bibentry:ioffe2015batch]]. 

[[bibliographystyle:plain]]
[[bibliography:bibliography.bib]] 

* Footnotes

[fn:1] måste läsa och faktiskt kunna skiten för att sammanfatta va

