relatedWork.tex

\subsection*{Architectural optimizations}
\label{sec:orgc3b24b0}
\bibliographystyle{plain}
\bibliography{bibliography} 
\end{document}